[
    {
        "pages": "1--27",
        "doi": "10.1016/j.csl.2024.101691",
        "url": "https://www.sciencedirect.com/science/article/pii/S0885230824000743",
        "keywords": "MMSE; Automatic speech and language analysis; NLP; Digital linguistic biomarkers; Emotion analysis; Perplexity; Naturalistic conversations; Enabling approach",
        "abstract": "Introduction: Automatic linguistic analysis can provide cost-effective, valuable clues to the diagnosis of cognitive difficulties and to therapeutic practice, and hence impact positively on wellbeing. In this work, we analyzed transcribed conversations between elderly individuals living with dementia and healthcare professionals. The material came from the Anchise 2022 Corpus, a large collection of transcripts of conversations in Italian recorded in naturalistic conditions. The aim of the work was to test the effectiveness of a number of automatic analyzes in finding correlations with the progression of dementia in individuals with cognitive decline as measured by the Mini-Mental State Examination (MMSE) score, which is the only psychometric-clinical information available on the participants in the conversations. Healthy controls (HC) were not considered in this study, nor does the corpus itself include HCs. The main innovation and strength of the work consists in the high ecological validity of the language analyzed (most of the literature to date concerns controlled language experiments); in the use of Italian (there is little corpora for Italian); in the size of the analyzed data (more than 200 conversations were considered); in the adoption of a wide range of NLP methods, that span from traditional morphosyntactic investigation to deep linguistic models for conducting analyzes such as through perplexity, sentiment (polarity) and emotions. Methods: Analyzing real-world interactions not designed with computational analysis in mind, such as is the case of the Anchise Corpus, is particularly challenging. To achieve the research goals, a wide variety of tools were employed. These included traditional morphosyntactic analysis based on digital linguistic biomarkers (DLBs), transformer-based language models, sentiment and emotion analysis, and perplexity metrics. Analyzes were conducted both on the continuous range of MMSE values and on the severe/moderate/mild categorization suggested by AIFA (Italian Medicines Agency) guidelines, based on MMSE threshold values. Results and discussion: Correlations between MMSE and individual DLBs were weak, up to 0.19 for positive, and-0.21 for negative correlation values. Nevertheless, some correlations were statistically significant and consistent with the literature, suggesting that people with a greater degree of impairment tend to show a reduced vocabulary, to have anomia, to adopt a more informal linguist register, and to display a simplified use of verbs, with a decrease in the use of participles, gerunds, subjunctive moods, modal verbs, as well as a flattening in the use of the tenses towards the present to the detriment of the past. The-0.26 inverse correlation between perplexity and MMSE suggests that perplexity captures slightly more specific linguistic information, which can complement the MMSE scores. In the categorization tasks, the classifier based on DLBs achieved an F1 score of 0.79 for binary classification between SEVERE and MILD, and 0.61 for multi-label categorization. Sentiment and emotion analyzes showed inverse trends for joy while MMSE scores suggested that less impaired individuals were less joyful, or more \"negative\", than others. Considering the real-world context, this is consistent with the hypothesis of a gradual reduction in awareness in individuals affected by dementia.Finally, integrating various profiles of analysis has been proved to be effective in offering a wider picture of linguistic and communication deficits, as well as more precise data regarding the progression of dementia.",
        "volume": "89",
        "journal": "COMPUTER SPEECH AND LANGUAGE",
        "year": "9999",
        "title": "A computational analysis of transcribed speech of people living with dementia: The Anchise 2022 Corpus",
        "author": "Sigona, Francesco and Radicioni, Daniele P. and Gili Fivela, Barbara and Colla, Davide and Delsanto, Matteo and Mensa, Enrico and Bolioli, Andrea and Vigorelli, Pietro",
        "ENTRYTYPE": "article",
        "ID": "2318_2010850"
    },
    {
        "pages": "1--7",
        "url": "http://ceur-ws.org/Vol-2769/paper_48.pdf",
        "abstract": "English. In this paper we propose a method for collecting a dictionary to deal with noisy medical text documents. The quality of such Italian Emergency Room Reports is so poor that in most cases these can be hardly automatically elaborated; this also holds for other languages (e.g., English), with the notable difference that no Italian dictionary has been proposed to deal with this jargon. In this work we introduce and evaluate a resource designed to fill this gap.",
        "booktitle": "Proceedings of the Seventh Italian Conference on Computational Linguistics",
        "volume": "Vol-2769",
        "address": "Aachen, Germany",
        "publisher": "CEUR",
        "year": "2021",
        "title": "A Resource for Detecting Misspellings and Denoising Medical Text Data",
        "author": "Mensa, Enrico and Gian Manuel Marino,  and Colla, Davide and Delsanto, Matteo and Radicioni, Daniele P.",
        "ENTRYTYPE": "conference",
        "ID": "2318_1775465"
    },
    {
        "pages": "24--34",
        "isbn": "978-91-8075-250-3",
        "doi": "10.3384/ecp197003",
        "url": "https://ecp.ep.liu.se/index.php/sltc/article/view/679/585",
        "booktitle": "Proceedings of the 12th Workshop on Natural Language Processing for Computer Assisted Language Learning (NLP4CALL 2023)",
        "volume": "197",
        "address": "Linköping",
        "publisher": "Linköping University Electronic Press",
        "year": "2023",
        "title": "EliCoDe at MultiGED2023: fine-tuning XLM-RoBERTa for multilingual grammatical error detection",
        "author": "Colla, Davide and Delsanto, Matteo and Di Nuovo, Elisa",
        "ENTRYTYPE": "conference",
        "ID": "2318_1904240"
    },
    {
        "publisher": "Università degli Studi di Torino",
        "year": "2024",
        "title": "Exploring Transformers: Journey Through Language Processing Architectures and Tasks",
        "author": "",
        "ENTRYTYPE": "phdthesis",
        "ID": "2318_2028887"
    },
    {
        "pages": "114--124",
        "booktitle": "Proceedings of the Workshop on DeTermIt! Evaluating Text Difficulty in a Multilingual Context @ LREC-COLING 2024",
        "address": "Parigi",
        "publisher": "ELRA",
        "year": "2024",
        "title": "Legal Text Reader Profiling: Evidences from Eye Tracking and Surprisal Based Analysis",
        "author": "Scozzaro, C. J. and Colla, D. and Delsanto, M. and Mastropaolo, A. and Mensa, E. and Revelli, L. and Radicioni, D. P.",
        "ENTRYTYPE": "conference",
        "ID": "2318_2010851"
    },
    {
        "pages": "1--5",
        "isbn": "9781450356169",
        "doi": "10.1145/3206505.3206516",
        "url": "https://dl.acm.org/citation.cfm?id=3206516",
        "keywords": "Search Results Visualization, 2D/3D Geographical Maps, Opacity Tuning, Visual Information Filtering",
        "abstract": "In Geographical Information search, map visualization can challenge the user because results can consist of a large set of heterogeneous items, increasing visual complexity.\nWe propose a novel visualization model to address this issue. Our model represents results as markers, or as geometric objects, on 2D/3D layers, using stylized and highly colored shapes to enhance their visibility. Moreover, the model supports interactive information filtering in the map by enabling the user to focus on different data categories, using transparency sliders to tune the opacity, and thus the emphasis, of the corresponding data items. \nA test with users provided positive results concerning the efficacy of the model.",
        "booktitle": "Proceedings of the 2018 International Conference on Advanced Visual Interfaces",
        "address": "New York",
        "publisher": "ACM",
        "year": "2018",
        "title": "Map-based visualization of 2D/3D spatial data via stylization and tuning of information emphasis",
        "author": "Ardissono, Liliana and Delsanto, Matteo and Lucenteforte, Maurizio and Mauro, Noemi and Savoca, Adriano and Scanu, Daniele",
        "ENTRYTYPE": "conference",
        "ID": "2318_1669352"
    },
    {
        "pages": "137--150",
        "isbn": "978-3-031-47546-7",
        "doi": "10.1007/978-3-031-47546-7_10",
        "url": "https://link.springer.com/chapter/10.1007/978-3-031-47546-7_10",
        "booktitle": "Proceedings of the 22nd International Conference of the Italian Association for Artificial Intelligence",
        "volume": "14318",
        "address": "Cham",
        "publisher": "Springer Nature Switzerland",
        "year": "2023",
        "title": "Mining Argument Components in Essays at Different Levels",
        "author": "Demaria, Roberto and Colla, Davide and Delsanto, Matteo and Mensa, Enrico and Pasini, Enrico and Radicioni, Daniele P.",
        "ENTRYTYPE": "conference",
        "ID": "2318_1932470"
    },
    {
        "pages": "87--97",
        "booktitle": "Artificial Intelligence for Healthcare",
        "volume": "3307",
        "address": "Aachen",
        "publisher": "CEUR",
        "year": "2022",
        "title": "Road Accidents: Information Extraction from Clinical Reports",
        "author": "Mensa, Enrico and Liberatore, Daniele and Colla, Davide and Delsanto, Matteo and Giustini, Marco and Radicioni, Daniele P.",
        "ENTRYTYPE": "conference",
        "ID": "2318_1883481"
    },
    {
        "pages": "108799--108805",
        "doi": "10.1016/j.dib.2022.108799",
        "url": "https://www.sciencedirect.com/science/article/pii/S2352340922010022?via=ihub",
        "keywords": "Inter-subject semantic reliability; Intra-subject semantic reliability; Language models; Perplexity metrics; Speech transcripts; Spoken language analysis;",
        "abstract": "The Semantic Coherence Dataset has been designed to experiment with semantic coherence metrics. More specifically, the dataset has been built to the ends of testing whether probabilistic measures, such as perplexity, provide stable scores to analyze spoken language. Perplexity, which was originally conceived as an information-theoretic measure to assess the probabilistic inference properties of language models, has recently been proven to be an appropriate tool to categorize speech transcripts based on semantic coherence accounts. More specifically, perplexity has been successfully employed to discriminate subjects suffering from Alzheimer Disease and healthy controls. Collected data include speech transcripts, intended to investigate semantic coherence at different levels: data are thus arranged into two classes, to investigate intra-subject semantic coherence, and inter-subject semantic coherence. In the former case transcripts from a single speaker can be employed to train and test language models and to explore whether the perplexity metric provides stable scores in assessing talks from that speaker, while allowing to distinguish between two different forms of speech, political rallies and interviews. In the latter case, models can be trained by employing transcripts from a given speaker, and then used to measure how stable the perplexity metric is when computed using the model from that user and transcripts from different users. Transcripts were extracted from talks lasting almost 13 hours (overall 12:45:17 and 120,326 tokens) for the former class; and almost 30 hours (29:47:34 and 252,270 tokens) for the latter one. Data herein can be reused to perform analyses on measures built on top of language models, and more in general on measures that are aimed at exploring the linguistic features of text documents.",
        "volume": "46",
        "journal": "DATA IN BRIEF",
        "year": "2023",
        "title": "Semantic Coherence Dataset: Speech transcripts",
        "author": "Colla, Davide and Delsanto, Matteo and Daniele Paolo Radicioni, ",
        "ENTRYTYPE": "article",
        "ID": "2318_1883288"
    },
    {
        "pages": "1--15",
        "doi": "10.48550/arxiv.2302.01025",
        "booktitle": "The HC@AIxIA 2022 Workshop (and the AIxIA Working Group on Artificial Intelligence for Healthcare)",
        "year": "2023",
        "title": "Semantic Coherence Markers for the Early Diagnosis of the Alzheimer Disease",
        "author": "Colla, Davide and Delsanto, Matteo and Agosto, Marco and Vitiello, Benedetto and Daniele Paolo Radicioni, ",
        "ENTRYTYPE": "conference",
        "ID": "2318_1945510"
    },
    {
        "pages": "0--16",
        "doi": "10.1016/j.artmed.2022.102393",
        "keywords": "Automatic language analysis; Diagnosis of dementia; Early diagnosis; Language models; Mental and cognitive disorders; Perplexity;",
        "abstract": "Devising automatic tools to assist specialists in the early detection of mental disturbances and psychotic disorders is to date a challenging scientific problem and a practically relevant activity. In this work we explore how language models (that are probability distributions over text sequences) can be employed to analyze language and discriminate between mentally impaired and healthy subjects. We have preliminarily explored whether perplexity can be considered a reliable metrics to characterize an individual's language. Perplexity was originally conceived as an information-theoretic measure to assess how much a given language model is suited to predict a text sequence or, equivalently, how much a word sequence fits into a specific language model. We carried out an extensive experimentation with healthy subjects, and employed language models as diverse as N-grams – from 2-grams to 5-grams – and GPT-2, a transformer-based language model. Our experiments show that irrespective of the complexity of the employed language model, perplexity scores are stable and sufficiently consistent for analyzing the language of individual subjects, and at the same time sensitive enough to capture differences due to linguistic registers adopted by the same speaker, e.g., in interviews and political rallies. A second array of experiments was designed to investigate whether perplexity scores may be used to discriminate between the transcripts of healthy subjects and subjects suffering from Alzheimer Disease (AD). Our best performing models achieved full accuracy and F-score (1.00 in both precision/specificity and recall/sensitivity) in categorizing subjects from both the AD class, and control subjects. These results suggest that perplexity can be a valuable analytical metrics with potential application to supporting early diagnosis of symptoms of mental disorders.",
        "volume": "134",
        "journal": "ARTIFICIAL INTELLIGENCE IN MEDICINE",
        "year": "2022",
        "title": "Semantic coherence markers: The contribution of perplexity metrics",
        "author": "Colla, Davide and Delsanto, Matteo and Agosto, Marco and Vitiello, Benedetto and Daniele Paolo Radicioni, ",
        "ENTRYTYPE": "article",
        "ID": "2318_1875282"
    },
    {
        "pages": "1--17",
        "booktitle": "Advances In Argumentation In Artificial Intelligence",
        "volume": "3354",
        "address": "Aachen",
        "publisher": "CEUR",
        "year": "2022",
        "title": "Shuffling-Based Data Augmentation for Argument Mining",
        "author": "Demaria, Roberto and Delsanto, Matteo and Colla, Davide and Mensa, Enrico and Pasini, Enrico and Radicioni, Daniele P.",
        "ENTRYTYPE": "conference",
        "ID": "2318_1883482"
    },
    {
        "pages": "1--3",
        "isbn": "9781450356169",
        "doi": "10.1145/3206505.3206566",
        "url": "https://dl.acm.org/citation.cfm?id=3206566",
        "keywords": "Search Results Visualization, 2D/3D Geographical Maps, Opacity Tuning, Visual Information Filtering",
        "abstract": "The presentation of search results in GIS can expose the user to cluttered geographical maps, challenging the identification of relevant information. In order to address this issue, we propose a visualization model supporting interactive information filtering on 2D/3D maps. Our model is based on the introduction of transparency sliders that enable the user to tune the opacity, and thus the emphasis, of data categories in the map. In this way, he or she can focus the maps on the most relevant types of information for the task to be performed. \nA test with users provided positive results concerning the efficacy of our model.",
        "booktitle": "Proceedings of the 2018 International Conference on Advanced Visual Interfaces",
        "address": "New York",
        "publisher": "ACM",
        "year": "2018",
        "title": "Transparency-based information filtering on 2D/3D geographical maps",
        "author": "Ardissono, Liliana and Delsanto, Matteo and Lucenteforte, Maurizio and Mauro, Noemi and Savoca, Adriano and Scanu, Daniele",
        "ENTRYTYPE": "conference",
        "ID": "2318_1669353"
    }
]